# Hodor

## Hodor

```
$ irb
> require 'hodor'
 => true
> Hodor
 => Hodor
> Hodor.hello
 => Hodor
> Hodor.any_method_at_all(*%w(with any args))
 => Hodor
> Hodor.can.chain?
 => Hodor
```